posts/Emacs/2015-04-04-Helm-Hydra-Modes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-05 Fri 20:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Helm and Hydra minor modes</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="Dominik Schrempf" />
<meta name="description" content="Incremental completion and bindings that stick around."
 />
<meta name="keywords" content="Incremental Completion, Find, Keybinding" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<meta name="viewport" content="width=device-width"/>
</head>
<body>
<div id="preamble" class="status">
<div class='nav'>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/archive.html'>Archive</a></li>
<li><a href='http://github.com/dschrempf'>GitHub</a></li>
</ul>
</div>
</div>
<div id="content">
<h1 class="title">Emacs Helm and Hydra minor modes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3acba7f">Helm mode</a></li>
<li><a href="#org20f9eba">Hydra mode</a></li>
</ul>
</div>
</div>
<p>
Recently, I stumbled upon two nice Emacs minor modes.
</p>

<div id="outline-container-org3acba7f" class="outline-2">
<h2 id="org3acba7f">Helm mode</h2>
<div class="outline-text-2" id="text-org3acba7f">
<p>
Helm mode offers an <b>incremental completion</b> and <b>selection narrowing</b>
framework.  It will help you to find what you're looking for in Emacs
(like buffers, files, commands etc).  Resources and discussions can be
found at the following homepages:
</p>
<ul class="org-ul">
<li>development and installation instructions at the <a href="https://github.com/emacs-helm/helm">Helm mode GitHub page</a>;</li>
<li>the Emacs initialization files and <a href="https://github.com/thierryvolpiatto/emacs-tv-config">configuration of the Helm maintainer</a>;</li>
<li><a href="http://tuhdo.github.io/helm-intro.html">a good overview of the features</a> and a sample configuration.</li>
</ul>

<p>
I can recommend to use the <code>TAB</code> key for completion and not for other
actions.  You can bind the <code>TAB</code> key back to
<code>helm-execute-persistent-action</code> with
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Bind TAB to complete stuff.</span>
(define-key helm-map (kbd <span style="color: #CC9393;">"TAB"</span>)         'helm-execute-persistent-action)
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Rebind `</span><span style="color: #7F9F7F;">helm-select-action</span><span style="color: #7F9F7F;">' (originally bound to TAB).</span>
(define-key helm-map (kbd <span style="color: #CC9393;">"C-j"</span>)         'helm-select-action)
</pre>
</div>

<p>
I had used <a href="http://emacswiki.org/emacs/InteractivelyDoThings">Ido mode</a> extensively before I switched to Helm mode.  I
must admit that the first thought was: too heavy and, oh, I miss the
insertion with <code>RET</code> as well as that Ido remembers which files I had
visited earlier.  Also, completion cannot be used when looking for
commands with <code>helm-M-x</code>.  However, with Helm mode I enjoy most that I
get an overview of what is out there.  That is what I miss with Ido
mode.  Try it out yourself!
</p>
</div>
</div>

<div id="outline-container-org20f9eba" class="outline-2">
<h2 id="org20f9eba">Hydra mode</h2>
<div class="outline-text-2" id="text-org20f9eba">
<p>
Hydra mode makes Emacs key bindings stick around so that they can be
used without modifiers.  It also displays them on the screen, so that
rarely used shortcuts can be remembered without looking into the
configuration files again (and again and again).  It is very useful!
</p>

<p>
Check it out:
</p>
<ul class="org-ul">
<li>source code and introduction at <a href="https://github.com/abo-abo/hydra">Hydra mode on GitHub</a>;</li>
<li>some blog entries of the creator at <a href="http://oremacs.com/archive/">(or emacs irrelevant)</a>.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
<script>
    var disqus_config = function () {
        this.page.identifier = '(Emacs Helm and Hydra minor modes)';
    };
    (function() {
        var d = document, s = d.createElement('script');

        s.src = '//dschrempf.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript><div class='footer'>
Copyright 2015 Dominik Schrempf<br/>
Last updated <span class="timestamp-wrapper"><span class="timestamp">2016-08-05</span></span><br/>
Built with <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.3.5) <br/>
<a href="http://validator.w3.org/check?uri=referer">Validate</a> HTML
</div>
<script type='text/javascript'>
 (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
 (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
 m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
 })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

 ga('create', 'UA-57993874-1', 'auto');
 ga('send', 'pageview');

</script>
</div>
</body>
</html>
